espressif/esp-gmf/elements/gmf_ai_audio/examples/aec_rec/sdkconfig.defaults.esp32
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET="esp32"
CONFIG_IDF_TARGET_ESP32=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0000

CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_SPEED=80

#
# ESP System Settings
#
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80 is not set
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160 is not set
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_GMF_AI_AUDIO_AEC_INPUT_SAMPLING_RATE_8K=y
CONFIG_GMF_AI_AUDIO_AEC_CH_ALLOCATION="RM"
